# Pandas

In [5]:
import pandas as pd

### Series

In [4]:
city1=pd.Series([30,-20,15,-8])

In [5]:
city1

0    30
1   -20
2    15
3    -8
dtype: int64

In [6]:
city1.values

array([ 30, -20,  15,  -8], dtype=int64)

In [7]:
city1.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
city1.dtype

dtype('int64')

In [15]:
city2=pd.Series([30,-20,15,-8], index=['day1', 'day2', 'day3', 'day4'])

In [16]:
city2

day1    30
day2   -20
day3    15
day4    -8
dtype: int64

In [17]:
city2['day3']

15

In [20]:
city2[['day1', 'day2', 'day3']]

day1    30
day2   -20
day3    15
dtype: int64

In [21]:
city2>0

day1     True
day2    False
day3     True
day4    False
dtype: bool

In [22]:
city2[city2>0]

day1    30
day3    15
dtype: int64

In [23]:
city2.min()

-20

In [26]:
city2.max()

30

In [27]:
city2[(city2>10)&(city2>15)]

day1    30
dtype: int64

In [28]:
city2+5

day1    35
day2   -15
day3    20
day4    -3
dtype: int64

In [29]:
data = {'Kerala':28, 'Andhra':25, 'TN':28, 'Delhi':35}

In [32]:
pd.Series(data)

Kerala    28
Andhra    25
TN        28
Delhi     35
dtype: int64

In [33]:
data

{'Kerala': 28, 'Andhra': 25, 'TN': 28, 'Delhi': 35}

In [34]:
data = pd.Series(data)

In [35]:
data

Kerala    28
Andhra    25
TN        28
Delhi     35
dtype: int64

In [36]:
states = ['Kerala', 'MP', 'TN', 'Delhi', 'Jammu']

In [37]:
states

['Kerala', 'MP', 'TN', 'Delhi', 'Jammu']

In [40]:
city4=pd.Series(data, index=states)

In [41]:
city4

Kerala    28.0
MP         NaN
TN        28.0
Delhi     35.0
Jammu      NaN
dtype: float64

In [42]:
city4.isna()

Kerala    False
MP         True
TN        False
Delhi     False
Jammu      True
dtype: bool

In [43]:
city4[city4.isna()]

MP      NaN
Jammu   NaN
dtype: float64

In [44]:
city4.notna()

Kerala     True
MP        False
TN         True
Delhi      True
Jammu     False
dtype: bool

In [45]:
city4[city4.notna()]

Kerala    28.0
TN        28.0
Delhi     35.0
dtype: float64

# More applications using Panda

### Data Frames

In [2]:
data = {'Year':[2001,2002,2003,2004,2005],
        'States':['Kerala','TN','Bihar','HP','MP'],
        'Pop': [200,300,400,580,680]}

In [3]:
data

{'Year': [2001, 2002, 2003, 2004, 2005],
 'States': ['Kerala', 'TN', 'Bihar', 'HP', 'MP'],
 'Pop': [200, 300, 400, 580, 680]}

In [6]:
pop_data=pd.DataFrame(data)

In [7]:
pop_data

   Year  States  Pop
0  2001  Kerala  200
1  2002      TN  300
2  2003   Bihar  400
3  2004      HP  580
4  2005      MP  680

In [8]:
pop_data1=pd.DataFrame(pop_data, columns=['Year', 'States','Pop', 'Income'])

In [9]:
pop_data1

   Year  States  Pop  Income
0  2001  Kerala  200     NaN
1  2002      TN  300     NaN
2  2003   Bihar  400     NaN
3  2004      HP  580     NaN
4  2005      MP  680     NaN

In [10]:
pop_data1['Income']=[20000,40000,10000,50000,80000]

In [11]:
pop_data1

   Year  States  Pop  Income
0  2001  Kerala  200   20000
1  2002      TN  300   40000
2  2003   Bihar  400   10000
3  2004      HP  580   50000
4  2005      MP  680   80000

In [12]:
pop_data1['debt'] = [50,60,1,30,100]

In [13]:
pop_data1

   Year  States  Pop  Income  debt
0  2001  Kerala  200   20000    50
1  2002      TN  300   40000    60
2  2003   Bihar  400   10000     1
3  2004      HP  580   50000    30
4  2005      MP  680   80000   100

In [14]:
pop_data1['savings'] = pop_data1['Income'] - pop_data1['debt']

In [15]:
pop_data1

   Year  States  Pop  Income  debt  savings
0  2001  Kerala  200   20000    50    19950
1  2002      TN  300   40000    60    39940
2  2003   Bihar  400   10000     1     9999
3  2004      HP  580   50000    30    49970
4  2005      MP  680   80000   100    79900

In [19]:
auto_data = pd.read_csv('auto-mpg.csv')

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (1145928912.py, line 1)